{"question": "What are the research interests and specializations of the faculty in the Information Systems Technology and Design (ISTD) area at SUTD?"}
{"question": "What are the research interests and specializations of the faculty in the Science, Mathematics and Technology (SMT) area at SUTD?"}
{"question": "What are the research interests and specializations of the faculty in the Architectural Conservation area at SUTD?"}
{"question": "What are the research interests and specializations of the faculty in the sciences area at SUTD?"}
{"question": "What are the research interests and specializations of the faculty in the engineering area at SUTD?"}
{"question": "Could you provide details on past capstone projects related to Product Development undertaken by SUTD students?"}
{"question": "Could you provide details on past capstone projects related to Engineering Systems and Design undertaken by SUTD students?"}
{"question": "Could you provide details on past capstone projects related to Information Systems Technology and Design undertaken by SUTD students?"}
{"question": "Could you provide details on past capstone projects related to AI/ML undertaken by SUTD students?"}
{"question": "Could you provide details on past capstone projects related to IoT/Robotics undertaken by SUTD students?"}
{"question": "Could you provide details on past capstone projects related to Logistics & Supply Chain undertaken by SUTD students?"}
{"question": "Could you provide details on past capstone projects related to Healthcare undertaken by SUTD students?"}
{"question": "Does SUTD offer career counseling services tailored to students in undergraduate?"}
{"question": "Does SUTD offer career counseling services tailored to students in postgraduate?"}
{"question": "What kind of internship opportunities are available to SUTD students interested in industry?"}
{"question": "How does SUTD facilitate connections between students and potential employers in the various backgrounds and industries sector?"}
{"question": "Does the career services department at SUTD offer workshops on skills development or job searching?"}
{"question": "How can students leverage the SUTD alumni network for career advice or internship opportunities related to engineering?"}
{"question": "How can students leverage the SUTD alumni network for career advice or internship opportunities related to management?"}
{"question": "What are the Undergraduate housing options available for students at SUTD and what is the application process?"}
{"question": "What are the Non-graduating student housing options available for students at SUTD and what is the application process?"}
{"question": "What Dining are available to students on the SUTD campus and what are their operating hours?"}
{"question": "What Academic facilities are available to students on the SUTD campus and what are their operating hours?"}
{"question": "What are the dining options and food indian/vegetarian available on or near the SUTD campus?"}
{"question": "What transportation options are available for students to get to and from SUTD, and around Singapore from Expo MRT Station?"}
{"question": "What transportation options are available for students to get to and from SUTD, and around Singapore from Changi South Avenue 1?"}
{"question": "What transportation options are available for students to get to and from SUTD, and around Singapore from Max Pavilion?"}
{"question": "What transportation options are available for students to get to and from SUTD, and around Singapore from Somapah Road?"}
{"question": "What are the available loan options for covering tuition fees and living expenses while studying undergraduate at SUTD?"}
{"question": "What are the available loan options for covering tuition fees and living expenses while studying postgraduate at SUTD?"}
{"question": "What are the available loan options for covering tuition fees and living expenses while studying PhD at SUTD?"}
{"question": "What are the available loan options for covering tuition fees and living expenses while studying master's degree at SUTD?"}
{"question": "How accessible is the SUTD campus via buses?"}
{"question": "How accessible is the SUTD campus via Bus?"}
{"question": "How accessible is the SUTD campus via Train?"}
{"question": "How accessible is the SUTD campus via MRT & LRT?"}
{"question": "What security measures are in place on the SUTD campus, especially around opera stage?"}
{"question": "What security measures are in place on the SUTD campus, especially around double-tier pavilion?"}
{"question": "What security measures are in place on the SUTD campus, especially around antique Zhejiang houses?"}
{"question": "What facilities are included in the student housing blocks at SUTD?"}
{"question": "What facilities are included in the university housing at SUTD?"}
{"question": "What facilities are included in the on campus dorms at SUTD?"}
{"question": "When and how do I apply for housing for May/June 2025 at SUTD?"}
{"question": "When and how do I apply for housing for 2025 at SUTD?"}
{"question": "What counseling services are available to students struggling with their issue or condition at SUTD?"}
{"question": "Does SUTD offer any workshops or programs focused on improving student mental health during Examinations?"}
{"question": "What accessibility services are provided by SUTD for students with physical impairment?"}
{"question": "What accessibility services are provided by SUTD for students with hearing impairment?"}
{"question": "What accessibility services are provided by SUTD for students with visual impairment?"}
{"question": "What kind of financial aid and support services are offered to international students at SUTD who are facing hardship?"}
{"question": "How can undergraduate students find faculty members whose research interests align with Applied at SUTD?"}
{"question": "How can undergraduate students find faculty members whose research interests align with Architectural Conservation at SUTD?"}
{"question": "How can undergraduate students find faculty members whose research interests align with Architectural History & Theory at SUTD?"}
{"question": "What research Academic Media Studio are available to undergraduate students participating in research at SUTD?"}
{"question": "What research Capstone Rooms are available to undergraduate students participating in research at SUTD?"}
{"question": "What research Characterization Lab are available to undergraduate students participating in research at SUTD?"}
{"question": "What research Chemistry-Biology Learning Lab are available to undergraduate students participating in research at SUTD?"}
{"question": "What research Cleanroom are available to undergraduate students participating in research at SUTD?"}
{"question": "What research Cohort Classrooms are available to undergraduate students participating in research at SUTD?"}
{"question": "What research Computer Lab are available to undergraduate students participating in research at SUTD?"}
{"question": "What research Translational Research Lab (DesignZ) are available to undergraduate students participating in research at SUTD?"}
{"question": "Does SUTD have a showcase or event where undergraduate students can present their research projects related to Science, Mathematics and Technology?"}
{"question": "Does SUTD have a showcase or event where undergraduate students can present their research projects related to Competition?"}
{"question": "Does SUTD have a showcase or event where undergraduate students can present their research projects related to Conference/Symposium?"}
{"question": "Does SUTD have a showcase or event where undergraduate students can present their research projects related to Exhibition/Showcase?"}
{"question": "Does SUTD have a showcase or event where undergraduate students can present their research projects related to Outreach Programme?"}
{"question": "Does SUTD have a showcase or event where undergraduate students can present their research projects related to Seminar/Lecture?"}
{"question": "Does SUTD have a showcase or event where undergraduate students can present their research projects related to Workshop?"}
{"question": "How can students report safety concerns or incidents on campus, and what support is available after criminal incidents?"}
{"question": "How can students report safety concerns or incidents on campus, and what support is available after safety and health incidents?"}
{"question": "What resources does SUTD provide to support student mental wellness and safety, particularly during stressful periods like Examinations?"}
{"question": "How does the pillar system at SUTD help students explore different disciplines before specializing in architecture?"}
{"question": "How does the pillar system at SUTD help students explore different disciplines before specializing in engineering?"}
{"question": "How does the pillar system at SUTD help students explore different disciplines before specializing in design and artificial intelligence?"}
{"question": "What hands-on learning opportunities are available for students in the undergraduate program at SUTD, such as projects or internships?"}
{"question": "How does SUTD foster interdisciplinary collaboration between students from different undergraduate?"}
{"question": "How does SUTD foster interdisciplinary collaboration between students from different postgraduate?"}
{"question": "What kind of technology-enhanced learning resources or Academic facilities does SUTD provide to support student learning?"}
{"question": "What kind of technology-enhanced learning resources or Housing does SUTD provide to support student learning?"}
{"question": "What kind of technology-enhanced learning resources or Sports and recreation centre does SUTD provide to support student learning?"}
{"question": "What kind of technology-enhanced learning resources or F&B and services does SUTD provide to support student learning?"}
{"question": "What internship opportunities are available to students studying Master of Architecture at SUTD?"}
{"question": "What industry partnerships does SUTD have that benefit students interested in employers?"}
{"question": "What industry partnerships does SUTD have that benefit students interested in industry?"}
{"question": "What career services and resources are available to SUTD students and alumni seeking jobs in Information & Communication?"}
{"question": "What career services and resources are available to SUTD students and alumni seeking jobs in Financial & Insurance?"}
{"question": "What career services and resources are available to SUTD students and alumni seeking jobs in Scientific Research & Development?"}
{"question": "What career services and resources are available to SUTD students and alumni seeking jobs in finance and corporate development?"}
{"question": "What career services and resources are available to SUTD students and alumni seeking jobs in global markets division?"}
{"question": "What career services and resources are available to SUTD students and alumni seeking jobs in global sales and origination?"}
{"question": "What career services and resources are available to SUTD students and alumni seeking jobs in operations and technology?"}
{"question": "What is the graduate employment rate for SUTD graduates 2021 months after graduation?"}
{"question": "What is the graduate employment rate for SUTD graduates 2022 months after graduation?"}
{"question": "What are the main research areas of faculty in the Science, Mathematics, and Technology (SMT) department at SUTD?"}
{"question": "What are the main research areas of faculty in the Architectural Conservation department at SUTD?"}
{"question": "What are the main research areas of faculty in the Architectural History & Theory department at SUTD?"}
{"question": "Are there opportunities for undergraduate students to participate in research projects related to research at SUTD?"}
{"question": "What research facilities are available to students and faculty working on Academic Media Studio projects at SUTD?"}
{"question": "What research facilities are available to students and faculty working on Capstone Rooms projects at SUTD?"}
{"question": "What research facilities are available to students and faculty working on Characterization Lab projects at SUTD?"}
{"question": "What research facilities are available to students and faculty working on Chemistry-Biology Learning Lab projects at SUTD?"}
{"question": "What research facilities are available to students and faculty working on Cleanroom projects at SUTD?"}
{"question": "What research facilities are available to students and faculty working on Cohort Classrooms projects at SUTD?"}
{"question": "What research facilities are available to students and faculty working on Computer Lab projects at SUTD?"}
{"question": "What research facilities are available to students and faculty working on Data Analytics Lab projects at SUTD?"}
{"question": "Does SUTD collaborate with other universities or industry partners on research related to cyber-physical learning?"}
{"question": "Does SUTD collaborate with other universities or industry partners on research related to design?"}
{"question": "What funding opportunities are available for students pursuing research in Biology at SUTD?"}
{"question": "What funding opportunities are available for students pursuing research in Chemistry at SUTD?"}
{"question": "What funding opportunities are available for students pursuing research in Mathematics at SUTD?"}
{"question": "What funding opportunities are available for students pursuing research in Pedagogy Innovation at SUTD?"}
{"question": "What funding opportunities are available for students pursuing research in Physics at SUTD?"}
{"question": "Are there any scholarships or grants available to SUTD students participating in study abroad programs in Canada?"}
{"question": "Are there any scholarships or grants available to SUTD students participating in study abroad programs in Mexico?"}
{"question": "Are there any scholarships or grants available to SUTD students participating in study abroad programs in USA?"}
{"question": "How does SUTD handle credit transfer for courses taken during exchange programs at Aalto University?"}
{"question": "How does SUTD handle credit transfer for courses taken during exchange programs at Zhejiang University?"}
{"question": "What are the different Single room (non-ensuite) options available for students at SUTD, and what are their respective costs?"}
{"question": "What are the different Single room options available for students at SUTD, and what are their respective costs?"}
{"question": "What are the different 1-bedroom apartment options available for students at SUTD, and what are their respective costs?"}
{"question": "What are the different 2-bedroom apartment options available for students at SUTD, and what are their respective costs?"}
{"question": "What Tennis facilities and recreational opportunities are available on the SUTD campus?"}
{"question": "What Ballroom Dancing Club are popular among students at SUTD, and how can I join them?"}
{"question": "What Bands Club are popular among students at SUTD, and how can I join them?"}
{"question": "What Chamber Ensemble Club are popular among students at SUTD, and how can I join them?"}
{"question": "What Chinese Orchestra Club are popular among students at SUTD, and how can I join them?"}
{"question": "What Crochet Interest Group are popular among students at SUTD, and how can I join them?"}
{"question": "What Dance DerivativeZ Club are popular among students at SUTD, and how can I join them?"}
{"question": "What Drama Club are popular among students at SUTD, and how can I join them?"}
{"question": "What FUNKtion Club are popular among students at SUTD, and how can I join them?"}
{"question": "What career services and resources are available to help SUTD students find Spring opportunities?"}
{"question": "What career services and resources are available to help SUTD students find Summer opportunities?"}
{"question": "What career services and resources are available to help SUTD students find Fall opportunities?"}
{"question": "What kind of campus events and activities are planned for AY2024-onwards at SUTD?"}
{"question": "What are the guidelines for submitting a portfolio for graduate at SUTD?"}
{"question": "What are the guidelines for submitting a portfolio for undergraduate at SUTD?"}
{"question": "What does the interview process entail for applicants to Master program at SUTD?"}
{"question": "What does the interview process entail for applicants to undergraduate at SUTD?"}
{"question": "Are there any specific prerequisite courses required for admission to the Undergraduate program at SUTD?"}
{"question": "Are there any specific prerequisite courses required for admission to the Postgraduate program at SUTD?"}
{"question": "What kind of projects or experiences should I include in my portfolio to showcase my suitability for Master of Science in Technology at SUTD?"}
{"question": "What scholarship opportunities are available for international students pursuing undergraduate at SUTD?"}
{"question": "What scholarship opportunities are available for international students pursuing PhD at SUTD?"}
{"question": "Does SUTD offer specific financial aid programs for students from Singapore?"}
{"question": "Does SUTD offer specific financial aid programs for students from International Students?"}
{"question": "Are there any tuition fee payment plans available for students enrolled in tuition fees at SUTD?"}
{"question": "What are the on-campus housing options, specifically the housing blocks facilities, available for students at SUTD?"}
{"question": "What are the on-campus housing options, specifically the university housing facilities, available for students at SUTD?"}
{"question": "What are the on-campus housing options, specifically the on campus dorms facilities, available for students at SUTD?"}
{"question": "What are the on-campus housing options, specifically the Dorm facilities, available for students at SUTD?"}
{"question": "How accessible is the SUTD campus for students with disabilities?"}
{"question": "What kind of sports facilities, such as swimming pool, are available for students at SUTD?"}
{"question": "What kind of sports facilities, such as courts for various sports, are available for students at SUTD?"}
{"question": "What kind of sports facilities, such as fitness area, are available for students at SUTD?"}
{"question": "What are the transportation options available for students to travel from North to SUTD?"}
{"question": "What are the transportation options available for students to travel from Singapore to SUTD?"}
{"question": "What dining options are available on campus, and are there options for students with vegan?"}
{"question": "What dining options are available on campus, and are there options for students with gluten-free?"}
{"question": "What dining options are available on campus, and are there options for students with halal?"}
{"question": "How is design thinking integrated into the 03.007 Design Thinking and Innovation curriculum at SUTD?"}
{"question": "How is design thinking integrated into the 01.020 Design Thinking Project III curriculum at SUTD?"}
{"question": "Are there any design thinking workshops or training programs offered to students during Semester 1 (Spring Term) at SUTD?"}
{"question": "Are there any design thinking workshops or training programs offered to students during January - May at SUTD?"}
{"question": "Are there any design thinking workshops or training programs offered to students during Semester 2 (Fall Term) at SUTD?"}
{"question": "Are there any design thinking workshops or training programs offered to students during Sept 14 at SUTD?"}
{"question": "Are there any interdisciplinary Architecture and Sustainable Design (ASD) offered at SUTD that encourage collaboration between different pillars?"}
{"question": "Are there any interdisciplinary Engineering Product Development (EPD) offered at SUTD that encourage collaboration between different pillars?"}
{"question": "Are there any interdisciplinary Engineering Systems and Design (ESD) offered at SUTD that encourage collaboration between different pillars?"}
{"question": "Are there any interdisciplinary Information Systems Technology and Design offered at SUTD that encourage collaboration between different pillars?"}
{"question": "Are there any interdisciplinary Introduction to Design offered at SUTD that encourage collaboration between different pillars?"}
{"question": "Are there any interdisciplinary The World Since 1400 offered at SUTD that encourage collaboration between different pillars?"}
{"question": "What kind of support, such as Capstone rooms or mentorship, does SUTD provide for team-based projects?"}
{"question": "What kind of support, such as IDC or mentorship, does SUTD provide for team-based projects?"}
{"question": "Besides coursework, what other opportunities are there for students to collaborate on projects, such as through MIT Club of Singapore or competitions?"}
{"question": "Can students from different pillars collaborate on capstone projects or other major projects during Semester 1 (Spring Term): January - May?"}
{"question": "Can students from different pillars collaborate on capstone projects or other major projects during Semester 2 (Fall Term)?"}
{"question": "Can students from different pillars collaborate on capstone projects or other major projects during Sept 14?"}
{"question": "Are there dedicated collaboration spaces or Group Study Room available for students working on team projects?"}
{"question": "Are there dedicated collaboration spaces or Recreational Room available for students working on team projects?"}
{"question": "Are there dedicated collaboration spaces or Hostel Lounge available for students working on team projects?"}
{"question": "Are there dedicated collaboration spaces or Sports and Recreation Centre available for students working on team projects?"}
{"question": "Are there dedicated collaboration spaces or Gym available for students working on team projects?"}
{"question": "Are there dedicated collaboration spaces or Indoor Sports Hall available for students working on team projects?"}
{"question": "How is design thinking integrated into the Generative AI for Design curriculum at SUTD?"}
{"question": "Can you provide examples of past capstone projects undertaken by students in the Architecture and Sustainable Design pillar?"}
{"question": "Can you provide examples of past capstone projects undertaken by students in the Engineering Product Development pillar?"}
{"question": "Can you provide examples of past capstone projects undertaken by students in the Engineering Systems and Design pillar?"}
{"question": "Can you provide examples of past capstone projects undertaken by students in the Design and Artificial Intelligence pillar?"}
{"question": "What kind of design projects are students involved in during January - May at SUTD?"}
{"question": "What kind of design projects are students involved in during September at SUTD?"}
{"question": "What kind of equipment and resources are available in the maker spaces or SUTD Makerspace at SUTD?"}
{"question": "What kind of equipment and resources are available in the maker spaces or FabLab resources at SUTD?"}
{"question": "What kind of equipment and resources are available in the maker spaces or Metal and Wood shop at SUTD?"}
{"question": "What kind of equipment and resources are available in the maker spaces or Electronics Shop at SUTD?"}
{"question": "How does SUTD incorporate hands-on learning into the Engineering curriculum?"}
{"question": "How does SUTD incorporate hands-on learning into the Humanities curriculum?"}
{"question": "How does SUTD incorporate hands-on learning into the Social Sciences curriculum?"}
{"question": "Are there opportunities for students to receive funding for their design projects or educational expenses at SUTD?"}
{"question": "Are there opportunities for students to receive funding for their design projects or innovation at SUTD?"}
{"question": "Are there opportunities for students to receive funding for their design projects or entrepreneurship at SUTD?"}
{"question": "Are there opportunities for students to receive funding for their design projects or social entrepreneurs at SUTD?"}
{"question": "Are there opportunities for students to receive funding for their design projects or research commercialisation at SUTD?"}
{"question": "What design competitions or challenges does SUTD participate in, and how can students get involved in 3D Printing and Design Innovation Challenge?"}
{"question": "What design competitions or challenges does SUTD participate in, and how can students get involved in ArchiFuture Design Challenge?"}
{"question": "What kind of overseas internship opportunities are available to SUTD students, particularly in the field of Industry?"}
{"question": "Does SUTD offer any global leadership programs or workshops for students interested in international?"}
{"question": "What funding or scholarships are available to SUTD students participating in global exposure programs like Global Leadership Programme?"}
{"question": "What funding or scholarships are available to SUTD students participating in global exposure programs like summer programmes?"}
{"question": "What funding or scholarships are available to SUTD students participating in global exposure programs like summer research programmes?"}
{"question": "How does SUTD handle credit transfer for courses taken during exchange programs at Aalto University?"}
{"question": "How does SUTD handle credit transfer for courses taken during exchange programs at Zhejiang University?"}
{"question": "What internship opportunities are available for students studying Master of Architecture at SUTD?"}
{"question": "Which companies does SUTD partner with for industries related projects and research?"}
{"question": "What career services does SUTD offer to help students find jobs after graduation, particularly in finance?"}
{"question": "What career services does SUTD offer to help students find jobs after graduation, particularly in corporate development?"}
{"question": "What career services does SUTD offer to help students find jobs after graduation, particularly in global markets division?"}
{"question": "What career services does SUTD offer to help students find jobs after graduation, particularly in global sales and origination?"}
{"question": "What career services does SUTD offer to help students find jobs after graduation, particularly in operations and technology?"}
{"question": "What career services does SUTD offer to help students find jobs after graduation, particularly in Information & Communication?"}
{"question": "What career services does SUTD offer to help students find jobs after graduation, particularly in Financial & Insurance?"}
{"question": "What career services does SUTD offer to help students find jobs after graduation, particularly in Scientific Research & Development?"}
{"question": "How does the SUTD alumni network support graduates seeking employment in Singapore?"}
{"question": "How can undergraduate students find faculty mentors for research projects in research at SUTD?"}
{"question": "What kind of Undergraduate Research Opportunities Programme (UROP) projects are offered during January - May at SUTD?"}
{"question": "What kind of Undergraduate Research Opportunities Programme (UROP) projects are offered during September at SUTD?"}
{"question": "How can I join a new fifth row for people with an interest/passion in coffee or start a new club at SUTD?"}
{"question": "What sports Sports and Recreation Centre are available to students at SUTD?"}
{"question": "What sports Gym are available to students at SUTD?"}
{"question": "What sports Indoor Sports Hall are available to students at SUTD?"}
{"question": "What sports Pool are available to students at SUTD?"}
{"question": "What sports Dance Studio are available to students at SUTD?"}
{"question": "What are the different student housing blocks options available for students at SUTD, and what are the application processes?"}
{"question": "Besides clubs, what other extracurricular activities are available for students to participate in at SUTD?"}
{"question": "Besides clubs, what other extracurricular Fifth Rows are available for students to participate in at SUTD?"}
{"question": "Besides clubs, what other extracurricular Undergraduate Opportunities are available for students to participate in at SUTD?"}
{"question": "Does SUTD offer any Electronics workshops or events for students to develop new skills?"}
{"question": "Is a portfolio submission required for Master program applications at SUTD?"}
{"question": "Is a portfolio submission required for undergraduate applications at SUTD?"}
{"question": "What does the interview process entail for prospective students applying to Master program at SUTD?"}
{"question": "What does the interview process entail for prospective students applying to undergraduate at SUTD?"}
{"question": "What types of financial aid are available to international students applying to SUTD for AY2024?"}
{"question": "Does SUTD offer an early admission program, and what are the benefits for Early matriculation?"}
{"question": "Does SUTD offer an early admission program, and what are the benefits for Integrated Learning Programme (ILP)?"}
{"question": "Does SUTD offer an early admission program, and what are the benefits for TP-SUTD Pathway Programme?"}
{"question": "What are the prerequisite courses or knowledge areas recommended for applying to Undergraduate Programs at SUTD?"}
{"question": "What are the prerequisite courses or knowledge areas recommended for applying to Postgraduate Programs at SUTD?"}
{"question": "What are the prerequisite courses or knowledge areas recommended for applying to Master program at SUTD?"}
{"question": "What scholarship opportunities are available for international students pursuing undergraduate at SUTD?"}
{"question": "What scholarship opportunities are available for international students pursuing PhD at SUTD?"}
{"question": "Does SUTD offer specific financial aid or grants for students from international?"}
{"question": "What are the different student housing options available for students at SUTD, and what are their respective amenities?"}
{"question": "What are the different graduate housing options available for students at SUTD, and what are their respective amenities?"}
{"question": "What are the different Hostel options available for students at SUTD, and what are their respective amenities?"}
{"question": "What are the different food options available on the SUTD campus, and what is the average cost of a Meals?"}
{"question": "What accessibility features are available in Garage on the SUTD campus for students with disabilities?"}
{"question": "What accessibility features are available in Building on the SUTD campus for students with disabilities?"}
{"question": "What kind of research are faculty members in Architecture and Sustainable Design (ASD) currently involved in at SUTD?"}
{"question": "What kind of research are faculty members in Engineering Product Development (EPD) currently involved in at SUTD?"}
{"question": "What kind of research are faculty members in Engineering Systems and Design (ESD) currently involved in at SUTD?"}
{"question": "What are the backgrounds and expertise of professors teaching Engineering at SUTD?"}
{"question": "What are the backgrounds and expertise of professors teaching Humanities at SUTD?"}
{"question": "What are the backgrounds and expertise of professors teaching Social Sciences at SUTD?"}
{"question": "Have any SUTD faculty members received awards or recognition for their work in Natural Language Processing?"}
{"question": "Have any SUTD faculty members received awards or recognition for their work in Sentiment Analysis?"}
{"question": "Have any SUTD faculty members received awards or recognition for their work in Emotion Recognition?"}
{"question": "Have any SUTD faculty members received awards or recognition for their work in 5G/6G?"}
{"question": "Have any SUTD faculty members received awards or recognition for their work in wireless communications?"}
{"question": "Have any SUTD faculty members received awards or recognition for their work in Internet-of-Things?"}
{"question": "Have any SUTD faculty members received awards or recognition for their work in smart grid?"}
{"question": "Where can I find a list of recent publications by faculty in the Science, Mathematics and Technology (SMT) at SUTD?"}
{"question": "How does the pillar system at SUTD help students choose their specialization after freshmore?"}
{"question": "Can you describe how design thinking is integrated into the Design Thinking Project II curriculum at SUTD?"}
{"question": "Can you describe how design thinking is integrated into the Design Thinking and Innovation curriculum at SUTD?"}
{"question": "What kind of hands-on learning opportunities are available to students in the Engineering program at SUTD?"}
{"question": "What kind of hands-on learning opportunities are available to students in the Humanities program at SUTD?"}
{"question": "What kind of hands-on learning opportunities are available to students in the Social Sciences program at SUTD?"}
{"question": "What kind of hands-on learning opportunities are available to students in the Science, Technology, Engineering and Mathematics (STEM) program at SUTD?"}
{"question": "How does the collaboration with MIT influence the Math I: Single-Variable Calculus content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the Physics I content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the Chemistry content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the World Civilizations: Ideas and Texts I content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the Math II: Multi-Variable Calculus content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the Physics II content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the Introduction to Design content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the World Civilizations: Ideas and Texts II content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the Modeling the Systems World content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the Applied Probability for Engineering Systems content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the Optimization content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the Applied Statistics content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the Network Modeling of Complex Systems content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the Systems Architecture content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the Decision and Risk Analysis: Exploring Options & Flexibility content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the Project Management content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the System Dynamics content and teaching methods at SUTD?"}
{"question": "How does the collaboration with MIT influence the Architecture Core Studio 1 content and teaching methods at SUTD?"}
{"question": "What are the main research areas of faculty in the Science, Mathematics and Technology (SMT) department at SUTD?"}
{"question": "What are the main research areas of faculty in the Engineering Systems and Design (ESD) department at SUTD?"}
{"question": "Are there opportunities for undergraduate students to participate in Engineering research at SUTD?"}
{"question": "Are there opportunities for undergraduate students to participate in Humanities research at SUTD?"}
{"question": "Are there opportunities for undergraduate students to participate in Social Sciences research at SUTD?"}
{"question": "What kind of research facilities are available to students and faculty working on Electronic Design at SUTD?"}
{"question": "What kind of research facilities are available to students and faculty working on advanced manufacturing at SUTD?"}
{"question": "What kind of research facilities are available to students and faculty working on artificial intelligence at SUTD?"}
{"question": "What kind of research facilities are available to students and faculty working on data science at SUTD?"}
{"question": "What kind of research facilities are available to students and faculty working on urban at SUTD?"}
{"question": "What kind of research facilities are available to students and faculty working on Data Analytics at SUTD?"}
{"question": "Does SUTD offer any collaborative research opportunities with companies?"}
{"question": "Does SUTD offer any collaborative research opportunities with Tecnológico de Monterrey?"}
{"question": "Does SUTD offer any collaborative research opportunities with Tec?"}
{"question": "Does SUTD offer any collaborative research opportunities with Thales?"}
{"question": "Where can I find publications by SUTD faculty in the field of 5G/6G?"}
{"question": "Where can I find publications by SUTD faculty in the field of wireless communications?"}
{"question": "Where can I find publications by SUTD faculty in the field of Internet-of-Things?"}
{"question": "Where can I find publications by SUTD faculty in the field of smart grid?"}
{"question": "What student Ballroom Dancing Club are popular at SUTD and how can I join?"}
{"question": "What student Bands Club are popular at SUTD and how can I join?"}
{"question": "What student Chamber Ensemble Club are popular at SUTD and how can I join?"}
{"question": "What student Chinese Orchestra Club are popular at SUTD and how can I join?"}
{"question": "What student Crochet Interest Group are popular at SUTD and how can I join?"}
{"question": "What student Dance DerivativeZ Club are popular at SUTD and how can I join?"}
{"question": "What student Drama Club are popular at SUTD and how can I join?"}
{"question": "What student FUNKtion Club are popular at SUTD and how can I join?"}
{"question": "What student Digital Design and Development Club are popular at SUTD and how can I join?"}
{"question": "What is life like in the SUTD Dorm and what are the different residential options?"}
{"question": "What is life like in the SUTD Apartment and what are the different residential options?"}
{"question": "What is life like in the SUTD on campus dorms and what are the different residential options?"}
{"question": "What is life like in the SUTD university housing and what are the different residential options?"}
{"question": "What is life like in the SUTD off-campus accommodations and what are the different residential options?"}
{"question": "What opportunities are there for SUTD students to participate in feeding the underprivileged and give back to the community?"}
{"question": "What opportunities are there for SUTD students to participate in volunteering with fundraising opportunities and give back to the community?"}
{"question": "What opportunities are there for SUTD students to participate in online and remote volunteer opportunities and give back to the community?"}
{"question": "What opportunities are there for SUTD students to participate in volunteer work and give back to the community?"}
{"question": "What opportunities are there for SUTD students to participate in nourish the lives of those in need and give back to the community?"}
{"question": "What opportunities are there for SUTD students to participate in serving their community and give back to the community?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Engineering Systems?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Urban Systems?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Product Design?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Experience Design?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Engineering?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Information Systems?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Systems and Design?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Information Systems?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Architecture and Sustainable Design?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Human-Centric Design?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in AI Applications?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Artificial Intelligence?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Computer Engineering?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Data Analytics?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Financial Technology?"}
{"question": "What career opportunities are typically available to SUTD graduates with a degree in Security by Design?"}
{"question": "Does SUTD offer internship programs specifically tailored for students in the undergraduate program?"}
{"question": "Does SUTD offer internship programs specifically tailored for students in the Bachelor of Engineering program?"}
{"question": "Does SUTD offer internship programs specifically tailored for students in the Bachelor of Science in Architecture program?"}
{"question": "Does SUTD offer internship programs specifically tailored for students in the Design and Artificial Intelligence program?"}
{"question": "Does SUTD offer internship programs specifically tailored for students in the postgraduate program?"}
{"question": "Does SUTD offer internship programs specifically tailored for students in the Master of Engineering program?"}
{"question": "Does SUTD offer internship programs specifically tailored for students in the Master of Innovation by Design program?"}
{"question": "Does SUTD offer internship programs specifically tailored for students in the PhD program?"}
{"question": "Which companies does SUTD have strong industry partnerships with, particularly in the field of Healthcare?"}
{"question": "Which companies does SUTD have strong industry partnerships with, particularly in the field of Cities and Aviation?"}
{"question": "Which companies does SUTD have strong industry partnerships with, particularly in the field of Artificial Intelligence/Data Science?"}
{"question": "Which companies does SUTD have strong industry partnerships with, particularly in the field of Digital?"}
{"question": "Which companies does SUTD have strong industry partnerships with, particularly in the field of defence and security?"}
{"question": "Which companies does SUTD have strong industry partnerships with, particularly in the field of aerospace?"}
{"question": "Which companies does SUTD have strong industry partnerships with, particularly in the field of air traffic management?"}
{"question": "Which companies does SUTD have strong industry partnerships with, particularly in the field of smart cities?"}
{"question": "What kind of career support services, such as resume workshops or mock interviews, does SUTD offer to students preparing for Design innovator roles?"}
{"question": "What kind of career support services, such as resume workshops or mock interviews, does SUTD offer to students preparing for Innovation strategist roles?"}
{"question": "What kind of career support services, such as resume workshops or mock interviews, does SUTD offer to students preparing for Product/System/Service designer roles?"}
{"question": "What kind of career support services, such as resume workshops or mock interviews, does SUTD offer to students preparing for Business intelligence developer roles?"}
{"question": "What kind of career support services, such as resume workshops or mock interviews, does SUTD offer to students preparing for Data visualisation specialist roles?"}
{"question": "What kind of career support services, such as resume workshops or mock interviews, does SUTD offer to students preparing for Data roles?"}
{"question": "What kind of career support services, such as resume workshops or mock interviews, does SUTD offer to students preparing for architectural roles?"}
{"question": "What kind of career support services, such as resume workshops or mock interviews, does SUTD offer to students preparing for management roles?"}
{"question": "What kind of career support services, such as resume workshops or mock interviews, does SUTD offer to students preparing for Management Consultant roles?"}
{"question": "What kind of career support services, such as resume workshops or mock interviews, does SUTD offer to students preparing for Product Engineer roles?"}
{"question": "What kind of career support services, such as resume workshops or mock interviews, does SUTD offer to students preparing for Software Developer roles?"}
{"question": "What kind of career support services, such as resume workshops or mock interviews, does SUTD offer to students preparing for Software Engineer roles?"}
{"question": "What kind of career support services, such as resume workshops or mock interviews, does SUTD offer to students preparing for Design Engineer roles?"}
{"question": "What kind of career support services, such as resume workshops or mock interviews, does SUTD offer to students preparing for Mechanical roles?"}
{"question": "What are the typical graduate outcomes, including average starting salary and job placement rate, for SUTD graduates in Architecture and Sustainable Design (ASD)?"}
{"question": "What are the typical graduate outcomes, including average starting salary and job placement rate, for SUTD graduates in Engineering Product Development (EPD)?"}
{"question": "What are the typical graduate outcomes, including average starting salary and job placement rate, for SUTD graduates in Engineering Systems and Design (ESD)?"}
{"question": "What are the typical graduate outcomes, including average starting salary and job placement rate, for SUTD graduates in Humanities, Arts and Social Sciences?"}
{"question": "What are the specific portfolio requirements for the Degree program at SUTD, and are there examples of successful portfolios?"}
{"question": "What are the specific portfolio requirements for the SUTD courses program at SUTD, and are there examples of successful portfolios?"}
{"question": "What are the specific portfolio requirements for the Master program at SUTD, and are there examples of successful portfolios?"}
{"question": "What does the interview process entail for admissions to SUTD, and what kind of questions should I expect if applying for Degree courses?"}
{"question": "What does the interview process entail for admissions to SUTD, and what kind of questions should I expect if applying for SUTD courses?"}
{"question": "What does the interview process entail for admissions to SUTD, and what kind of questions should I expect if applying for Master program?"}
{"question": "What is the application fee for SUTD, and are there any fee waivers available for applicants from Singapore?"}
{"question": "What is the application fee for SUTD, and are there any fee waivers available for applicants from UK?"}
{"question": "What is the application fee for SUTD, and are there any fee waivers available for applicants from Sri Lanka?"}
{"question": "What is the application fee for SUTD, and are there any fee waivers available for applicants from Hong Kong?"}
{"question": "What is the application fee for SUTD, and are there any fee waivers available for applicants from Brunei?"}
{"question": "How many letters of recommendation are required for the application, and who should I ask to write them if I am applying for A-Level graduate?"}
{"question": "How many letters of recommendation are required for the application, and who should I ask to write them if I am applying for Polytechnic Diploma?"}
{"question": "How many letters of recommendation are required for the application, and who should I ask to write them if I am applying for Undergraduate Programs?"}
{"question": "How many letters of recommendation are required for the application, and who should I ask to write them if I am applying for Postgraduate Programs?"}
{"question": "What scholarship opportunities are available for international students pursuing PhD at SUTD?"}
{"question": "What scholarship opportunities are available for international students pursuing EngD at SUTD?"}
{"question": "What scholarship opportunities are available for international students pursuing undergraduate at SUTD?"}
{"question": "What are the eligibility criteria for financial aid for students enrolled in MOE-subsidised programmes at SUTD?"}
{"question": "What loan options are available to help cover the cost of studying Undergraduate Programs at SUTD?"}
{"question": "What loan options are available to help cover the cost of studying Postgraduate Programs at SUTD?"}
{"question": "Does SUTD offer installment payment plans for tuition fees for Semester 1 (Spring Term)?"}
{"question": "Does SUTD offer installment payment plans for tuition fees for Semester 2 (Fall Term)?"}
{"question": "Does SUTD offer installment payment plans for tuition fees for September-December?"}
{"question": "Does SUTD offer installment payment plans for tuition fees for January-April?"}
{"question": "What amenities are available in the Dorm at SUTD?"}
{"question": "What amenities are available in the Apartment at SUTD?"}
{"question": "What amenities are available in the 3 hostel blocks at SUTD?"}
{"question": "How accessible is the SUTD campus to public transportation, and what are the nearby Train options?"}
{"question": "How accessible is the SUTD campus to public transportation, and what are the nearby Bus options?"}
{"question": "How accessible is the SUTD campus to public transportation, and what are the nearby Taxi options?"}
{"question": "How accessible is the SUTD campus to public transportation, and what are the nearby MRT options?"}
{"question": "How accessible is the SUTD campus to public transportation, and what are the nearby Grabcar options?"}
{"question": "How accessible is the SUTD campus to public transportation, and what are the nearby subway options?"}
{"question": "How accessible is the SUTD campus to public transportation, and what are the nearby towncar options?"}
{"question": "How accessible is the SUTD campus to public transportation, and what are the nearby shuttle options?"}
{"question": "How accessible is the SUTD campus to public transportation, and what are the nearby foot options?"}
{"question": "What are the on-campus dining options and what is the typical cost of meals at SUTD?"}
{"question": "What are the on-campus dining options and what is the typical cost of snacks at SUTD?"}
{"question": "What are the on-campus dining options and what is the typical cost of breakfast at SUTD?"}
{"question": "Does SUTD offer essential tools and services for students, and how can students access them?"}
{"question": "Does SUTD offer Sports and Recreation Centre for students, and how can students access them?"}
{"question": "Does SUTD offer wide range of facilities for students, and how can students access them?"}
{"question": "Does SUTD offer academic spaces for students, and how can students access them?"}
{"question": "What are the options for off-campus housing near SUTD, and what is the average S$ 5,700 /mo?"}
{"question": "What are the options for off-campus housing near SUTD, and what is the average S$1,000.00?"}
{"question": "What are the options for off-campus housing near SUTD, and what is the average S$1,250.00?"}
{"question": "What are the options for off-campus housing near SUTD, and what is the average 2,812 SGD?"}
{"question": "What are the options for off-campus housing near SUTD, and what is the average 1,912 SGD?"}
{"question": "What are the options for off-campus housing near SUTD, and what is the average 5,282 SGD?"}
{"question": "What are the options for off-campus housing near SUTD, and what is the average 3,101 SGD?"}
{"question": "What are the available exchange program destinations for SUTD students studying Inbound exchange?"}
{"question": "What are the available exchange program destinations for SUTD students studying Student Exchange on a Reciprocal Basis?"}
{"question": "Does SUTD offer any global innovation programs or workshops during Semester 1 (Spring Term)?"}
{"question": "Does SUTD offer any global innovation programs or workshops during Semester 2 (Fall Term)?"}
{"question": "Does SUTD offer any global innovation programs or workshops during September-December?"}
{"question": "Does SUTD offer any global innovation programs or workshops during January-April?"}
{"question": "What kind of financial aid or scholarships are available to SUTD students participating in exchange programs at The University of British Columbia?"}
{"question": "What kind of financial aid or scholarships are available to SUTD students participating in exchange programs at Université de Montréal?"}
{"question": "What kind of financial aid or scholarships are available to SUTD students participating in exchange programs at University of Ottawa?"}
{"question": "Are there opportunities for SUTD students to participate in international research collaborations related to cyber physical learning?"}
{"question": "Are there opportunities for SUTD students to participate in international research collaborations related to data analytics?"}
{"question": "Are there opportunities for SUTD students to participate in international research collaborations related to learning sciences?"}
{"question": "What specializations are available within the Architecture and Sustainable Design (ASD) pillar at SUTD?"}
{"question": "What specializations are available within the Design and Artificial Intelligence (DAI) pillar at SUTD?"}
{"question": "What specializations are available within the Engineering Product Development (EPD) pillar at SUTD?"}
{"question": "Can you provide an overview of the coursework involved in the Modelling and Analysis course at SUTD?"}
{"question": "Can you provide an overview of the coursework involved in the Physical World course at SUTD?"}
{"question": "Can you provide an overview of the coursework involved in the Modelling Space and Systems course at SUTD?"}
{"question": "Can you provide an overview of the coursework involved in the Technological World course at SUTD?"}
{"question": "Can you provide an overview of the coursework involved in the Modelling Uncertainty course at SUTD?"}
{"question": "Can you provide an overview of the coursework involved in the Urban Theory Core Course course at SUTD?"}
{"question": "What interdisciplinary project opportunities are available for students in the Architecture and Sustainable Design pillar?"}
{"question": "What interdisciplinary project opportunities are available for students in the Design and Artificial Intelligence pillar?"}
{"question": "What interdisciplinary project opportunities are available for students in the Engineering pillar?"}
{"question": "What are the research interests and expertise of faculty members teaching Urban Theory Core Course at SUTD?"}
{"question": "What specializations are available within the Architecture and Sustainable Design (ASD) pillar at SUTD?"}
{"question": "What specializations are available within the Design and Artificial Intelligence (DAI) pillar at SUTD?"}
{"question": "What specializations are available within the Engineering Product Development (EPD) pillar at SUTD?"}
{"question": "Can I view the syllabus for Applied Probability for Engineering Systems before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Optimization before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Applied Statistics before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Network Modeling of Complex Systems before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Systems Architecture before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Decision and Risk Analysis: Exploring Options & Flexibility before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Project Management before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for System Dynamics before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Architecture Core Studio 1 before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Introduction to Systems & Programming before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Computation Structures before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Elements of Software Construction before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Introduction to Algorithms before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Computer System Engineering before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for User Interface Design and Implementation before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Machine Learning before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Computer Graphics before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for Introduction to Engineering Systems before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for 02.207 Organizations and People before deciding on my specialization at SUTD?"}
{"question": "Can I view the syllabus for SUTD EPD introductory control class 30.101 before deciding on my specialization at SUTD?"}
{"question": "What is the faculty expertise in the architecture specialization at SUTD?"}
{"question": "What is the faculty expertise in the engineering specialization at SUTD?"}
{"question": "What is the faculty expertise in the design and artificial intelligence specialization at SUTD?"}
{"question": "What are the key differences between the Engineering Systems and Design (ESD) and Engineering Product Development (EPD) pillars?"}
{"question": "What are the specific design thinking methodologies taught across all the pillars at SUTD?"}
{"question": "How does the curriculum in the Architecture and Sustainable Design (ASD) pillar address the challenges of climate change and urbanization in Singapore and globally?"}
{"question": "Can you provide examples of research opportunities available for undergraduate students within each pillar?"}
{"question": "What kind of support is offered to students interested in entrepreneurship, particularly in relation to their chosen pillar?"}
{"question": "How does the Computer Science and Design (CSD) pillar incorporate ethical considerations in the development of AI and other technologies?"}
{"question": "What is the student-to-faculty ratio in each pillar, and how does this impact the learning experience?"}
{"question": "Beyond the core curriculum, what elective courses are available within each pillar to allow for specialization in specific areas?"}
{"question": "How does the Design and Artificial Intelligence (DAI) pillar prepare students for the evolving landscape of AI and its impact on various industries?"}
{"question": "Are there opportunities for students to participate in international exchange programs or internships related to their pillar of study?"}
{"question": "What are the key differences between the Engineering Product Development (EPD) and Engineering Systems and Design (ESD) pillars?"}
{"question": "How does the curriculum in the Architecture and Sustainable Design (ASD) pillar address the challenges of climate change and urban sustainability?"}
{"question": "What are the specific research areas within the Computer Science and Design (CSD) pillar that faculty members are currently focused on?"}
{"question": "What is the student-to-faculty ratio in each pillar, and how does this impact the learning experience?"}
{"question": "Can you provide examples of successful startups or innovations that have emerged from projects within each of the pillars?"}
{"question": "How does the Design and Artificial Intelligence (DAI) pillar prepare students for roles in emerging AI-driven industries?"}
{"question": "What opportunities are there for students to participate in international exchange programs or internships related to their chosen pillar?"}
{"question": "How does SUTD foster collaboration between students in different pillars to tackle complex real-world problems?"}
{"question": "What are the prerequisites or recommended prior knowledge for each pillar?"}
{"question": "Beyond technical skills, what soft skills are emphasized within each pillar's curriculum?"}
{"question": "What specialization options are available after completing the Architecture and Sustainable Design (ASD) pillar at SUTD?"}
{"question": "What specialization options are available after completing the Engineering Product Development (EPD) pillar at SUTD?"}
{"question": "What specialization options are available after completing the Engineering Systems and Design (ESD) pillar at SUTD?"}
{"question": "What specialization options are available after completing the Information Systems Technology and Design (ISTD) pillar at SUTD?"}
{"question": "What are some common career paths for graduates who specialized in architecture and engineering at SUTD?"}
{"question": "What are some common career paths for graduates who specialized in design and artificial intelligence at SUTD?"}
{"question": "What are some common career paths for graduates who specialized in Engineering at SUTD?"}
{"question": "What are some common career paths for graduates who specialized in Humanities at SUTD?"}
{"question": "What are some common career paths for graduates who specialized in Social Sciences at SUTD?"}
{"question": "What are some common career paths for graduates who specialized in Artificial Intelligence at SUTD?"}
{"question": "What are some common career paths for graduates who specialized in Data Analytics at SUTD?"}
{"question": "What are some common career paths for graduates who specialized in Financial Technology at SUTD?"}
{"question": "What are some common career paths for graduates who specialized in IoT and Intelligent Systems at SUTD?"}
{"question": "What are some common career paths for graduates who specialized in Security at SUTD?"}
{"question": "What are some common career paths for graduates who specialized in Software Engineering at SUTD?"}
{"question": "What are some common career paths for graduates who specialized in Visual Analytics at SUTD?"}