{"question": "Can you elaborate on the types of projects students typically undertake in the Design and Artificial Intelligence (DAI) pillar?"}
{"question": "How does the curriculum in the Engineering Product Development (EPD) pillar integrate design thinking with engineering principles?"}
{"question": "What are the career prospects for graduates from each of the pillars"}
{"question": "How much flexibility is there to switch between pillars after the first year?"}
{"question": "What specific software and hardware resources are available to students in each pillar?"}
{"question": "How does SUTD facilitate collaboration between students from different pillars on interdisciplinary projects?"}
{"question": "What research opportunities are available for undergraduate students within each pillar?"}
{"question": "Could you provide examples of recent capstone projects from each pillar and their impact?"}
{"question": "How does the DAI pillar address ethical considerations in the development and deployment of AI technologies?"}
{"question": "What is the typical student-to-faculty ratio in each pillar?"}
{"question": "What are the specific admission requirements or recommended backgrounds for each pillar, beyond the general SUTD requirements?"}
{"question": "How does the ASD pillar address the challenges of designing for climate change and urban resilience?"}
{"question": "What are the opportunities for students in the ESD pillar to specialize in areas like supply chain management or data analytics?"}
{"question": "How does SUTD ensure that the curriculum in each pillar remains relevant and up-to-date with industry trends?"}
{"question": "What are the opportunities for international exchange or study abroad programs within each pillar?"}
{"question": "What are the five pillars of study at SUTD?"}
{"question": "Could you describe the key differences in curriculum and learning styles between the Architecture and Sustainable Design (ASD) and Engineering Product Development (EPD) pillars?"}
{"question": "What kind of research opportunities are available for students in the Information Systems Technology and Design (ISTD) pillar?"}
{"question": "How does the design-centric approach of SUTD integrate across all five pillars?"}
{"question": "What are some examples of capstone projects that students have undertaken in the Engineering Systems and Design (ESD) pillar, and what real-world problems did they address?"}
{"question": "How does SUTD prepare students for interdisciplinary collaboration across different pillars, both during their studies and in their future careers?"}
{"question": "What are the career prospects for graduates from each of the five pillars, and what industries do they typically enter?"}
{"question": "How does the curriculum in the Science, Mathematics and Technology (SMT) pillar support the other four pillars?"}
{"question": "What are the specific software or hardware skills that students gain within each pillar?"}
{"question": "Can you provide examples of how the SUTD curriculum is updated to reflect current industry trends and technological advancements within each pillar?"}
{"question": "How does SUTD foster innovation and entrepreneurship within each pillar, and what resources are available to students who want to start their own companies?"}
{"question": "What are the opportunities to specialize within each pillar? Are there specific tracks or concentrations?"}
{"question": "How does SUTD's focus on design thinking influence the problem-solving approaches taught in each pillar?"}
{"question": "What is the student-to-faculty ratio in each pillar, and how does this impact the learning experience?"}
{"question": "What are the admission requirements and selection criteria specific to each pillar?"}
{"question": "What are the five pillars of study at SUTD?"}
{"question": "Could you describe the key differences between the Architecture and Sustainable Design (ASD) and Engineering Product Development (EPD) pillars?"}
{"question": "What are the career prospects typically associated with each of the five pillars?"}
{"question": "How much flexibility is there to explore different pillars before committing to a specialization?"}
{"question": "What kind of projects or research opportunities are available within the Information Systems Technology and Design (ISTD) pillar, specifically related to cybersecurity?"}
{"question": "How does the curriculum in the Engineering Systems and Design (ESD) pillar integrate systems thinking and data analytics?"}
{"question": "What are the opportunities for interdisciplinary collaboration between students from different pillars on capstone projects?"}
{"question": "How does SUTD support students who wish to switch pillars after their freshman year?"}
{"question": "Can you provide examples of successful startups or innovations that have emerged from each of the pillars?"}
{"question": "What is the faculty-to-student ratio within each pillar, and how does this impact the learning experience?"}
{"question": "How does the ASD pillar address the challenges of urban density and climate change in its curriculum?"}
{"question": "What specific software and hardware tools are students trained on within the EPD pillar?"}
{"question": "How does the ISTD pillar prepare students for the ethical considerations of AI and data science?"}
{"question": "What are the specific elective courses offered within the ESD pillar that focus on supply chain management or logistics?"}
{"question": "Beyond the core curriculum, what opportunities are there to specialize further within each pillar, such as through minors or special programs?"}
{"question": "Could you briefly explain what the different pillars at SUTD are?"}{"question": "What clubs and organizations are available at SUTD?"}
{"question": "How can I start a new club or organization at SUTD if there isn't one that aligns with my interests?"}
{"question": "What sports teams does SUTD offer, and what is the process for trying out?"}
{"question": "Are there opportunities for students to participate in the arts, such as theater, music, or visual arts?"}
{"question": "What kind of funding and support does SUTD provide for student clubs and organizations?"}
{"question": "How does SUTD balance academics with extracurricular activities, and are there resources to help students manage their time effectively?"}
{"question": "What are some of the most popular or successful clubs and organizations at SUTD?"}
{"question": "Does SUTD offer any scholarships or grants specifically for students involved in extracurricular activities?"}
{"question": "How does the Fifth Row contribute to the overall SUTD student experience and culture?"}
{"question": "What kind of facilities and equipment are available for clubs and sports teams to use?"}
{"question": "Are there opportunities to compete against other universities in sports or academic competitions?"}
{"question": "How does SUTD support student-led initiatives and projects within the Fifth Row?"}
{"question": "What mentorship opportunities are available within the Fifth Row, either from faculty or alumni?"}
{"question": "How does participation in the Fifth Row enhance students' leadership and teamwork skills?"}
{"question": "Are there any interdisciplinary clubs or activities that combine design and technology with other fields like business or the arts?"}
{"question": "How are club activities impacted by the trimester system and the intense academic workload?"}
{"question": "What is the process for booking facilities (e.g., sports fields, classrooms) for club activities?"}
{"question": "How does SUTD ensure inclusivity and accessibility in its Fifth Row activities for students of all backgrounds and abilities?"}
{"question": "What Fifth Row activities are most popular among Freshmores?"}
{"question": "Can you provide a comprehensive list of all Fifth Row clubs and sports available at SUTD?"}
{"question": "How does SUTD support student-led initiatives for creating new Fifth Row clubs or activities?"}
{"question": "What are the time commitments typically involved in participating in different Fifth Row activities?"}
{"question": "Are there opportunities for Fifth Row activities to collaborate with external organizations or companies?"}
{"question": "How does SUTD ensure inclusivity and accessibility in Fifth Row activities for students with diverse backgrounds and abilities?"}
{"question": "What resources (e.g., funding, equipment, mentorship) are available to Fifth Row clubs and sports teams?"}
{"question": "How does participation in Fifth Row activities contribute to the overall SUTD student experience and personal development?"}
{"question": "Are there any Fifth Row activities that focus on social impact or community engagement?"}
{"question": "What is the process for joining a Fifth Row club or sports team, and are there any tryouts or application processes?"}
{"question": "How does the Fifth Row system integrate with the academic curriculum at SUTD, and are there opportunities for Fifth Row activities to earn academic credit?"}
{"question": "What kind of performance spaces or art studios are available for Fifth Row arts groups?"}
{"question": "How are Fifth Row activities impacted by COVID-19 restrictions, and what measures are in place to ensure student safety?"}
{"question": "Can you describe the leadership structure within typical Fifth Row clubs, and are there opportunities for students to take on leadership roles?"}
{"question": "What are some examples of successful Fifth Row projects or initiatives that have had a significant impact on the SUTD community?"}
{"question": "What are the opportunities for Fifth Row teams to compete with other universities in Singapore or internationally?"}
{"question": "How does SUTD promote Fifth Row activities to the student body and encourage participation?"}
{"question": "Are there any Fifth Row activities specifically designed to help Freshmores integrate into the SUTD community?"}
{"question": "How does the Fifth Row system at SUTD differ from extracurricular activities at other universities?"}
{"question": "What kind of support is provided to students who want to start their own sports team within the Fifth Row framework?"}
{"question": "How does SUTD balance the emphasis on academics with the importance of Fifth Row activities for student well-being?"}
{"question": "What are some examples of interdisciplinary projects or collaborations that have emerged from Fifth Row activities?"}
{"question": "Are there any Fifth Row activities that focus on promoting sustainability or environmental awareness?"}
{"question": "What is the role of faculty advisors in supporting Fifth Row clubs and sports teams?"}
{"question": "How does the Fifth Row office gather feedback from students about their experiences with Fifth Row activities, and how is this feedback used to improve the system?"}
{"question": "Are there any specific Fifth Row activities geared towards international students to help them integrate into the SUTD community?"}
{"question": "What opportunities are there for alumni to stay involved with Fifth Row activities after graduation?"}
{"question": "Beyond the official Fifth Rows, are there any informal student groups or activities that are also popular?"}
{"question": "What kind of training or workshops are offered to students who want to improve their skills in areas related to Fifth Row activities (e.g., leadership, event planning, coaching)?"}
{"question": "How does SUTD encourage innovation and creativity within the Fifth Row system?"}
{"question": "What is the process for securing funding for large-scale Fifth Row events or projects?"}
{"question": "How can I find out more about the performance schedules and event calendars of different Fifth Row groups?"}
{"question": "Are there any Fifth Row activities that specifically cater to students interested in entrepreneurship or innovation?"}
{"question": "What is the typical budget allocated to a Fifth Row club, and how is that budget determined?"}
{"question": "How does SUTD handle conflicts or disputes that may arise within Fifth Row clubs or sports teams?"}
{"question": "Are there any Fifth Row activities that focus on promoting mental health and well-being among students?"}
{"question": "What are the criteria used to evaluate the success of Fifth Row activities?"}
{"question": "How does SUTD ensure that Fifth Row activities are aligned with the university's overall mission and values?"}
{"question": "Are there any opportunities for students to present their Fifth Row projects or achievements at university-wide events?"}
{"question": "What is the role of the SUTD Student Government in supporting and representing the interests of Fifth Row clubs and sports teams?"}
{"question": "How does participation in Fifth Row activities impact a student's chances of securing internships or job opportunities after graduation?"}
{"question": "What are the most competitive Fifth Row activities to get into?"}
{"question": "Are there any Fifth Row activities that offer scholarships or financial aid to students?"}
{"question": "How does SUTD support students who want to start a Fifth Row activity that is not currently offered?"}
{"question": "Can you share some success stories of students who have significantly benefited from their involvement in Fifth Row activities?"}
{"question": "What are the different levels of competition within Fifth Row sports, and how does SUTD support teams at each level?"}
{"question": "Could you explain the overall philosophy behind SUTD's Pillar system and how it differs from traditional departmental structures?"}
{"question": "As a Freshmore, what resources are available to help me explore the different Pillars and choose the right specialization for me?"}
{"question": "What are the specific career paths that each specialization typically leads to, and what kind of industry connections does SUTD have to support those paths?"}
{"question": "Can you provide more detail on the curriculum structure within each Pillar, particularly regarding the balance between core subjects and elective courses?"}
{"question": "How does SUTD foster interdisciplinary collaboration between students from different Pillars?"}
{"question": "What opportunities are there for undergraduate research within each Pillar, and how can I get involved?"}
{"question": "How does the curriculum in each pillar adapt to emerging technologies and industry trends?"}
{"question": "What are the key skills and competencies that SUTD aims to develop in students within each specialization?"}
{"question": "Could you elaborate on the 'Fifth Row' activities and how they contribute to a well-rounded education at SUTD?"}
{"question": "How does SUTD support students who wish to switch Pillars after the Freshmore year, and what is the process for doing so?"}
{"question": "What is the student-to-faculty ratio within each Pillar, and how does this impact the learning experience?"}
{"question": "Are there any opportunities to take courses or participate in projects outside of my chosen Pillar?"}
{"question": "How does SUTD ensure that the curriculum in each Pillar remains relevant and up-to-date with industry needs?"}
{"question": "What kind of global opportunities (e.g., exchange programs, internships) are available to students in each Pillar?"}
{"question": "Can you describe a specific project or initiative that showcases the interdisciplinary nature of SUTD's Pillars?"}
{"question": "What kind of mentorship or advising is available to students within each Pillar to guide their academic and career development?"}
{"question": "How does SUTD evaluate the effectiveness of its Pillar system and make adjustments to improve the student experience?"}
{"question": "For a student interested in [Specific Field, e.g., AI], which Pillar and specialization would be the most suitable and why?"}
{"question": "How does SUTD integrate design thinking principles into the curriculum across all Pillars?"}
{"question": "What are the differences in the types of projects and capstone experiences offered within each specialization?"}
{"question": "What types of social events are typically organized for students at SUTD?"}
{"question": "Can you give me some examples of student-led clubs or societies that organize social activities?"}
{"question": "How does SUTD foster a sense of community among students, especially during the first year?"}
{"question": "Are there any major annual social events that SUTD students look forward to each year?"}
{"question": "What opportunities are there for students to participate in activities outside of the academic curriculum?"}
{"question": "How does SUTD support student initiatives for organizing new social events or activities?"}
{"question": "What are some examples of 'Fifth Rows' activities available to students, and how do they contribute to the social scene?"}
{"question": "Are there any specific social events or activities designed to help Freshmores integrate into the SUTD community?"}
{"question": "How does SUTD balance academic rigor with opportunities for students to socialize and participate in extracurricular activities?"}
{"question": "What resources are available for students who want to start a new club or organize a large-scale social event?"}
{"question": "How does SUTD ensure inclusivity in its social events and activities, catering to students with diverse interests and backgrounds?"}
{"question": "Beyond the Fifth Rows, what other avenues exist for students to pursue their hobbies and interests socially?"}
{"question": "How does the SUTD student government (or equivalent body) contribute to the social life on campus?"}
{"question": "Are there opportunities for students to participate in inter-university social events or competitions?"}
{"question": "What kind of support does SUTD provide for students who may feel isolated or struggle to connect with others socially?"}
{"question": "How does SUTD leverage its unique campus environment and facilities to enhance the social experience for students?"}
{"question": "Could you elaborate on the role of faculty and staff in fostering a positive social environment for students?"}
{"question": "What are some of the more unconventional or unique social events that have taken place at SUTD?"}
{"question": "How does SUTD promote responsible social behavior and ensure student safety during social events?"}
{"question": "What is the process for getting funding or approval for a student-organized social event?"}
{"question": "How are interdisciplinary projects integrated into the SUTD curriculum, particularly for Freshmores?"}
{"question": "Can you provide examples of successful interdisciplinary projects undertaken by SUTD students, and what were the key learnings?"}
{"question": "What resources and support are available to students working on interdisciplinary projects, such as mentorship or funding?"}
{"question": "How does SUTD foster collaboration between students from different pillars (e.g., Engineering Product Development, Architecture and Sustainable Design, Information Systems Technology and Design)?"}
{"question": "What is the role of faculty in guiding and facilitating interdisciplinary projects, and how are they selected for these roles?"}
{"question": "Are there opportunities to collaborate with industry partners on interdisciplinary projects, and what benefits do these collaborations offer?"}
{"question": "How are interdisciplinary projects assessed, and what criteria are used to evaluate student performance?"}
{"question": "What are the opportunities for Fifth Row activities to intersect and enhance interdisciplinary project work?"}
{"question": "How does SUTD encourage innovation and creativity within interdisciplinary projects?"}
{"question": "Beyond core curriculum, what extracurricular opportunities exist to participate in interdisciplinary projects, such as design competitions or hackathons?"}
{"question": "How do the interdisciplinary projects prepare students for future careers that require collaboration across different fields?"}
{"question": "What are the common challenges students face when working on interdisciplinary projects, and how does SUTD help them overcome these challenges?"}
{"question": "Are there specific interdisciplinary project tracks or specializations that students can pursue?"}
{"question": "How does SUTD ensure that interdisciplinary projects address real-world problems and have a positive impact?"}
{"question": "What is the typical team size for interdisciplinary projects, and how are teams formed to ensure a diverse range of skills and perspectives?"}
{"question": "What specific exchange programs are available with MIT, and what are the eligibility requirements for Freshmores?"}
{"question": "Can you provide details on the research collaborations SUTD has with Zhejiang University, particularly in the area of AI?"}
{"question": "How does SUTD support students financially for overseas opportunities, such as internships or exchange programs?"}
{"question": "What is the application process for the SUTD-MIT Joint Postdoctoral Program, and what are the key selection criteria?"}
{"question": "Beyond MIT and Zhejiang, what other universities does SUTD have significant global partnerships with, and in what areas?"}
{"question": "How do global opportunities at SUTD contribute to the development of 'Fifth Rows' skills, and are there specific programs designed to foster global citizenship?"}
{"question": "What kind of career support is offered to students after they participate in global programs, specifically in leveraging their international experience?"}
{"question": "Are there opportunities to participate in joint design projects or hackathons with students from partner universities, and how are these organized?"}
{"question": "What are the success rates of SUTD students applying to competitive programs like the SUTD-MIT Undergraduate Research Opportunities Program (UROP) International?"}
{"question": "How does SUTD ensure the academic credits earned at partner universities are seamlessly transferred back to the SUTD curriculum?"}
{"question": "What resources are available to students to learn about the cultural nuances and customs of the countries where SUTD has partner universities?"}
{"question": "How does SUTD measure the impact of its global partnerships on student learning outcomes and overall university reputation?"}
{"question": "What are the possibilities for Freshmores to take part in overseas workshops or short-term programs before the official exchange semesters?"}
{"question": "Does SUTD offer any language courses or cultural immersion programs to prepare students for studying or interning abroad?"}
{"question": "What are the typical job roles and industries that SUTD graduates enter after graduation?"}
{"question": "What is the average starting salary for SUTD graduates across different degree programs?"}
{"question": "How does SUTD support students in securing internships and full-time job opportunities?"}
{"question": "What kind of career guidance and mentorship programs are available for SUTD students?"}
{"question": "Does SUTD have partnerships with specific companies or organizations for recruitment purposes?"}
{"question": "What is the placement rate for SUTD graduates within six months of graduation?"}
{"question": "How does SUTD prepare students for the evolving demands of the tech and design industries?"}
{"question": "What are the opportunities for SUTD graduates to pursue entrepreneurship and start their own companies?"}
{"question": "Can you provide examples of successful SUTD alumni and their career paths?"}
{"question": "How does the SUTD curriculum, including the Fifth Row activities, contribute to career readiness?"}
{"question": "What resources are available to Freshmores to explore different career paths and industries?"}
{"question": "What kind of networking events and career fairs does SUTD host to connect students with potential employers?"}
{"question": "How does SUTD leverage its location in Singapore to provide access to global career opportunities?"}
{"question": "What support does SUTD offer to international students seeking employment in Singapore or abroad?"}
{"question": "How does SUTD's emphasis on interdisciplinary learning benefit graduates in the job market?"}
{"question": "How does the SUTD alumni network support current students and recent graduates in their career endeavors?"}
{"question": "What are the long-term career progression opportunities for SUTD graduates in their respective fields?"}
{"question": "What is the percentage of SUTD graduates who pursue postgraduate studies, and in what fields?"}
{"question": "How does SUTD track and measure the career success of its graduates over time?"}
{"question": "Beyond traditional internships, what other experiential learning opportunities (e.g., research projects, design challenges) contribute to career development at SUTD?"}
{"question": "What specific resources does SUTD offer to help students develop and prototype their innovative ideas, such as maker spaces or funding opportunities?"}
{"question": "How does the curriculum integrate design thinking and entrepreneurial principles across different disciplines at SUTD?"}
{"question": "What are some examples of successful startups or ventures that have emerged from SUTD's Innovation and Entrepreneurship ecosystem?"}
{"question": "Can you describe the mentorship opportunities available to students interested in entrepreneurship, and who are some of the mentors involved?"}
{"question": "What is the role of 'Fifth Rows' in fostering innovation and entrepreneurship at SUTD, and how can students get involved?"}
{"question": "How does SUTD support students in protecting their intellectual property and navigating the legal aspects of starting a business?"}
{"question": "What opportunities are there for students to collaborate with industry partners on real-world innovation challenges?"}
{"question": "How does the SUTD curriculum prepare 'Freshmores' for future innovation and entrepreneurship endeavors?"}
{"question": "What are the key differences between the various entrepreneurship-related courses and programs offered at SUTD, and which one might be best suited for my interests?"}
{"question": "Beyond technical skills, how does SUTD help students develop the soft skills (e.g., communication, leadership, teamwork) necessary for entrepreneurial success?"}
{"question": "What kind of funding or grant opportunities are available specifically for SUTD students who are developing innovative technologies or business models?"}
{"question": "How does SUTD facilitate networking opportunities with investors, venture capitalists, and other key stakeholders in the startup ecosystem?"}
{"question": "What support does SUTD offer for students interested in social entrepreneurship or developing innovations that address societal challenges?"}
{"question": "How does SUTD measure the success of its Innovation and Entrepreneurship programs, and what are the key performance indicators (KPIs)?"}
{"question": "What are the most popular student clubs and organizations at SUTD?"}
{"question": "How does SUTD foster a sense of community among its students, especially considering the intense academic workload?"}
{"question": "What opportunities are there for students to participate in sports and recreational activities?"}
{"question": "Can you describe the Fifth Rows system and how it contributes to student life and mentorship?"}
{"question": "What support systems are in place for international students to adjust to life in Singapore and at SUTD?"}
{"question": "How does SUTD address issues of diversity and inclusion within the student body?"}
{"question": "What are some of the unique SUTD traditions or events that students look forward to?"}
{"question": "What resources are available to students for mental health and well-being?"}
{"question": "How does SUTD encourage student entrepreneurship and innovation outside of the curriculum?"}
{"question": "What opportunities are there for students to engage with the local Singaporean community?"}
{"question": "How does the Freshmore curriculum integrate students into the SUTD community and culture?"}
{"question": "What is the typical weekend like for an SUTD student?"}
{"question": "Are there opportunities for students to participate in student-led initiatives and projects?"}
{"question": "How does SUTD support students in finding accommodation both on and off campus?"}
{"question": "What is the role of student government in shaping student life at SUTD?"}
{"question": "What are the Fifth Rows at SUTD and what is their purpose?"}
{"question": "How are Fifth Rows different from traditional student clubs or organizations at other universities?"}
{"question": "What specific Fifth Rows are available for Freshmores to join?"}
{"question": "What is the application or selection process for joining a Fifth Row?"}
{"question": "How much time commitment is typically required for active participation in a Fifth Row?"}
{"question": "Do Fifth Rows offer any opportunities for leadership development or skill-building?"}
{"question": "How do Fifth Rows contribute to the overall SUTD student experience and campus culture?"}
{"question": "Can you provide examples of projects or initiatives undertaken by specific Fifth Rows?"}
{"question": "Are there opportunities for inter-Fifth Row collaboration on projects or events?"}
{"question": "How are Fifth Rows funded and supported by SUTD?"}
{"question": "What resources and facilities are available to Fifth Rows for their activities?"}
{"question": "How do Fifth Rows align with SUTD's design-centric curriculum and pedagogy?"}
{"question": "What is the impact of Fifth Row participation on students' personal and professional growth?"}
{"question": "Are there any Fifth Rows specifically focused on social impact or community engagement?"}
{"question": "How do Fifth Rows help Freshmores integrate into the SUTD community?"}
{"question": "What are the key performance indicators (KPIs) used to measure the success of Fifth Rows?"}
{"question": "How does SUTD ensure diversity and inclusivity within Fifth Rows?"}
{"question": "Are there any Fifth Rows that focus on specific technologies or emerging fields?"}
{"question": "How do Fifth Rows interact with faculty and industry partners?"}
{"question": "What opportunities are there for Fifth Rows to showcase their work to a wider audience?"}
{"question": "How can Fifth Rows contribute to the development of new courses or programs at SUTD?"}
{"question": "Does participation in Fifth Rows offer any academic credit or recognition?"}
{"question": "What support is provided to Fifth Rows to ensure the safety and well-being of their members?"}
{"question": "How does SUTD evaluate the effectiveness of the Fifth Rows program in achieving its goals?"}
{"question": "Are there any Fifth Rows focused on entrepreneurship or innovation?"}
{"question": "How do Fifth Rows adapt to the evolving needs and interests of the SUTD student body?"}
{"question": "Can you describe the relationship between the Fifth Rows and the SUTD Student Government?"}
{"question": "How do Fifth Rows contribute to SUTD's reputation and brand?"}
{"question": "What are some of the most popular or well-regarded Fifth Rows at SUTD, and why?"}
{"question": "How can alumni support and contribute to the Fifth Rows program?"}
{"question": "What are the minimum academic requirements (e.g., grades, subjects) for admission to SUTD?"}
{"question": "What is the application deadline for international students?"}
{"question": "Does SUTD require standardized test scores like SAT or ACT for admission?"}
{"question": "What is the role of the 'Fifth Row' in the admissions process, and how can I highlight my involvement in extracurricular activities?"}
{"question": "How does SUTD evaluate applicants with diverse academic backgrounds (e.g., polytechnic diplomas, international qualifications)?"}
{"question": "What are the specific requirements for the portfolio submission, and what kind of projects are considered impressive?"}
{"question": "Can you provide more details about the interview process, including the types of questions asked and the criteria used to assess candidates?"}
{"question": "What scholarships and financial aid options are available for undergraduate students, and what are the eligibility criteria?"}
{"question": "How does SUTD assess applicants' problem-solving skills and creativity during the admissions process?"}
{"question": "What opportunities are there for Freshmores to explore different majors before committing to a specific program?"}
{"question": "What is the acceptance rate for international students applying to SUTD?"}
{"question": "If my high school curriculum does not directly align with SUTD's prerequisites, are there bridging courses or alternative pathways to admission?"}
{"question": "How does SUTD weigh academic achievements versus non-academic achievements in the overall admissions decision?"}
{"question": "What support services are available to international students during the application process and after admission?"}
{"question": "Can I apply to multiple programs at SUTD simultaneously, or do I need to choose one?"}
{"question": "What are the key attributes and qualities that SUTD looks for in prospective students, beyond academic performance?"}
{"question": "How does SUTD's admissions process differ from other universities in Singapore?"}
{"question": "What is the policy on advanced placement or credit transfer for students with prior university coursework?"}
{"question": "How can I best demonstrate my passion for technology and design in my application?"}
{"question": "What are the chances of getting a second interview if I do not perform well in the first one?"}
{"question": "What are the key research areas and focus areas within R&D at SUTD?"}
{"question": "How does SUTD foster interdisciplinary research collaborations, especially between the different pillars?"}
{"question": "What resources and facilities are available to support research and development activities at SUTD?"}
{"question": "What is the process for Freshmores to get involved in research projects at SUTD?"}
{"question": "Can you provide examples of successful research projects that have emerged from SUTD and their impact?"}
{"question": "What funding opportunities are available for research projects, both internal and external?"}
{"question": "How does SUTD support the commercialization of research findings and the development of spin-off companies?"}
{"question": "What is SUTD's approach to intellectual property (IP) management and technology transfer?"}
{"question": "How does SUTD encourage innovation and entrepreneurship among its students and faculty?"}
{"question": "What is the role of the Fifth Rows in driving research and innovation at SUTD?"}
{"question": "What are the opportunities for graduate students to conduct research as part of their thesis or dissertation?"}
{"question": "How does SUTD measure the impact and success of its research and development efforts?"}
{"question": "What are SUTD's collaborations with industry partners in R&D, and how can students get involved in these collaborations?"}
{"question": "What research ethics guidelines does SUTD have in place, and how are they enforced?"}
{"question": "How does SUTD ensure the safety and security of its research facilities and data?"}
{"question": "What is the typical timeline for a research project from conception to publication or commercialization?"}
{"question": "How does SUTD support researchers in publishing their work in high-impact journals and conferences?"}
{"question": "What opportunities are available for undergraduate students to present their research at conferences or workshops?"}
{"question": "How does SUTD integrate design thinking into its research and development process?"}
{"question": "What are the specific research opportunities available within the Architecture and Sustainable Design (ASD) pillar?"}
{"question": "What are the specific research opportunities available within the Engineering Product Development (EPD) pillar?"}
{"question": "What are the specific research opportunities available within the Engineering Systems and Design (ESD) pillar?"}
{"question": "What are the specific research opportunities available within the Information Systems Technology and Design (ISTD) pillar?"}
{"question": "How does SUTD leverage its location in Singapore to foster collaborations with other research institutions and companies in the region?"}
{"question": "What is the role of AI and machine learning in SUTD's current research initiatives?"}
{"question": "How does SUTD's R&D align with Singapore's national research priorities?"}
{"question": "Are there any specific research projects focused on addressing global challenges such as climate change or healthcare?"}
{"question": "What is the process for proposing a new research project at SUTD?"}
{"question": "How does SUTD support researchers in securing external funding from international organizations?"}
{"question": "What are the opportunities for international students to participate in research at SUTD?"}
{"question": "What kind of mentorship programs are available for students involved in research?"}
{"question": "How does SUTD incorporate feedback from industry partners into its research agenda?"}
{"question": "What is SUTD's strategy for attracting and retaining top research talent?"}
{"question": "How does SUTD's curriculum integrate with its research activities, and how does this benefit students?"}
{"question": "What are the long-term goals for R&D at SUTD, and how will these goals be achieved?"}
{"question": "How does SUTD handle conflicts of interest in research?"}
{"question": "What are the key performance indicators (KPIs) used to evaluate the success of SUTD's research programs?"}
